src/v2ray/route/site_data.org
#+TITLE: 域名文件
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../css/main.css" />
#+HTML_LINK_HOME: route.html
#+OPTIONS: num:nil timestamp:nil ^:nil
* 内置域名文件
在下载 V2Ray 的时候，下载的压缩包有一个 geosite.dat。这个文件是在路由功能里用到的，文件内置了许多常见的网站域名。配置方式如下：
#+begin_src js 
  {
      "type": "field",
      "outboundTag": "direct",
      "domain": [
	  "geosite:cn"
      ]
  }
#+end_src
+ geosite 指 geosite.dat 文件
+ 后面的 cn 是一个标签，代表着使用 geosite.dat 文件里的 cn 规则

通过它可以设定这些国内域名走直连,这样就相当把规则的域名写到一个文件里，然后在配置中引用这个域名文件
#+begin_example
好处是配置比较简洁，看起来比较干净
#+end_example
* 外置域名文件
#+begin_example
很多时候，V2Ray 内置的国内域名不能满足使用。不过 V2Ray 可以使用外部自定义的像 geosite.dat 这样的域名文件
#+end_example
1. 到 [[https://github.com/ToutyRater/V2Ray-SiteDAT/tree/master/geofiles][这里]] 下载 _h2y.dat_ 文件放到 V2Ray 运行文件的目录下
2. 按需要写路由规则，格式为 _ext:h2y.dat:tag_
   #+begin_src js 
     "rules":[
	 {
	     "type": "field",
	     "outboundTag": "block", //拦截广告相关域名
	     "domain": [
		 "ext:h2y.dat:ad"
	     ]
	 },
	 {
	     "type": "field",
	     "outboundTag": "proxy", //被 gfw 屏蔽的域名走代理
	     "domain": [
		 "ext:h2y.dat:gfw"
	     ]
	 },
	 {
	     "type": "field",
	     "network":"tcp,udp",
	     "outboundTag": "direct" // 默认直连
	 }
     ]
   #+end_src
   + ext 表示使用外部文件
   + h2y.dat 是具体的文件名
   + tag 泛指标签，有哪些标签由文件提供。下载的 h2y.dat 文件目前只有 ad 和 gfw 两个标签
     + ad 包含着常见的广告域名
     + gfw 包含着常见的被 gfw 屏蔽的域名
3. 运行 V2Ray

因为使用了 gfw 列表的用户，通常是想要默认情况下直连，但有时候习惯上在 outbounds 的第一个是代理的出站，所以在上面的配置中，最后加了一条直连的规则。那个 _network:"tcp,udp"_ 是为了让所有流量都能匹配上

#+begin_example
需要注意的是，目前所有第三方的 V2Ray GUI 客户端都不支持加载外置的域名文件
#+end_example

#+ATTR_HTML: :border 1 :rules all :frame boader
| [[file:bt.org][Next：禁用BT]] | [[file:route.org][Home：路由]] |
