html/v2ray/route/site_data.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>域名文件</title>
<meta name="author" content="Wu, Shanliang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="route.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">域名文件</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1bd89ba">内置域名文件</a></li>
<li><a href="#org93013d2">外置域名文件</a></li>
</ul>
</div>
</div>
<div id="outline-container-org1bd89ba" class="outline-2">
<h2 id="org1bd89ba">内置域名文件</h2>
<div class="outline-text-2" id="text-org1bd89ba">
<p>
在下载 V2Ray 的时候，下载的压缩包有一个 geosite.dat。这个文件是在路由功能里用到的，文件内置了许多常见的网站域名。配置方式如下：
</p>
<div class="org-src-container">
<pre class="src src-js">{
    <span style="color: #ffa07a;">"type"</span>: <span style="color: #ffa07a;">"field"</span>,
    <span style="color: #ffa07a;">"outboundTag"</span>: <span style="color: #ffa07a;">"direct"</span>,
    <span style="color: #ffa07a;">"domain"</span>: [
        <span style="color: #ffa07a;">"geosite:cn"</span>
    ]
}
</pre>
</div>
<ul class="org-ul">
<li>geosite 指 geosite.dat 文件</li>
<li>后面的 cn 是一个标签，代表着使用 geosite.dat 文件里的 cn 规则</li>
</ul>

<p>
通过它可以设定这些国内域名走直连,这样就相当把规则的域名写到一个文件里，然后在配置中引用这个域名文件
</p>
<pre class="example" id="orgd6a9f11">
好处是配置比较简洁，看起来比较干净
</pre>
</div>
</div>
<div id="outline-container-org93013d2" class="outline-2">
<h2 id="org93013d2">外置域名文件</h2>
<div class="outline-text-2" id="text-org93013d2">
<pre class="example" id="orgd9173e6">
很多时候，V2Ray 内置的国内域名不能满足使用。不过 V2Ray 可以使用外部自定义的像 geosite.dat 这样的域名文件
</pre>
<ol class="org-ol">
<li>到 <a href="https://github.com/ToutyRater/V2Ray-SiteDAT/tree/master/geofiles">这里</a> 下载 <span class="underline">h2y.dat</span> 文件放到 V2Ray 运行文件的目录下</li>
<li><p>
按需要写路由规则，格式为 <span class="underline">ext:h2y.dat:tag</span>
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #ffa07a;">"rules"</span>:[
    {
        <span style="color: #ffa07a;">"type"</span>: <span style="color: #ffa07a;">"field"</span>,
        <span style="color: #ffa07a;">"outboundTag"</span>: <span style="color: #ffa07a;">"block"</span>, <span style="color: #ff4500;">//</span><span style="color: #ff4500;">&#25318;&#25130;&#24191;&#21578;&#30456;&#20851;&#22495;&#21517;</span>
        <span style="color: #ffa07a;">"domain"</span>: [
            <span style="color: #ffa07a;">"ext:h2y.dat:ad"</span>
        ]
    },
    {
        <span style="color: #ffa07a;">"type"</span>: <span style="color: #ffa07a;">"field"</span>,
        <span style="color: #ffa07a;">"outboundTag"</span>: <span style="color: #ffa07a;">"proxy"</span>, <span style="color: #ff4500;">//</span><span style="color: #ff4500;">&#34987; gfw &#23631;&#34109;&#30340;&#22495;&#21517;&#36208;&#20195;&#29702;</span>
        <span style="color: #ffa07a;">"domain"</span>: [
            <span style="color: #ffa07a;">"ext:h2y.dat:gfw"</span>
        ]
    },
    {
        <span style="color: #ffa07a;">"type"</span>: <span style="color: #ffa07a;">"field"</span>,
        <span style="color: #ffa07a;">"network"</span>:<span style="color: #ffa07a;">"tcp,udp"</span>,
        <span style="color: #ffa07a;">"outboundTag"</span>: <span style="color: #ffa07a;">"direct"</span> <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#40664;&#35748;&#30452;&#36830;</span>
    }
]
</pre>
</div>
<ul class="org-ul">
<li>ext 表示使用外部文件</li>
<li>h2y.dat 是具体的文件名</li>
<li>tag 泛指标签，有哪些标签由文件提供。下载的 h2y.dat 文件目前只有 ad 和 gfw 两个标签
<ul class="org-ul">
<li>ad 包含着常见的广告域名</li>
<li>gfw 包含着常见的被 gfw 屏蔽的域名</li>
</ul></li>
</ul></li>
<li>运行 V2Ray</li>
</ol>

<p>
因为使用了 gfw 列表的用户，通常是想要默认情况下直连，但有时候习惯上在 outbounds 的第一个是代理的出站，所以在上面的配置中，最后加了一条直连的规则。那个 <span class="underline">network:"tcp,udp"</span> 是为了让所有流量都能匹配上
</p>

<pre class="example" id="orgfb252be">
需要注意的是，目前所有第三方的 V2Ray GUI 客户端都不支持加载外置的域名文件
</pre>

<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="bt.html">Next：禁用BT</a></td>
<td class="org-left"><a href="route.html">Home：路由</a></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
